esp8266/Arduino/libraries/esp8266/examples/HwdtStackDump/hwdt_app_entry.cpp
static uint32_t ICACHE_RAM_ATTR set_uart_speed(uint32_t uart_no, uint32_t new_speed) {
    (void)uart_no;

    // #if F_CRYSTAL == 40000000
#ifdef F_CRYSTAL
    constexpr uint32_t crystal_freq = F_CRYSTAL;
#else
    constexpr uint32_t crystal_freq = 26000000;
#endif
    constexpr uint32_t UART_CLK_DIVISOR_M = (0x000FFFFF);
    constexpr uint32_t rom_uart_speed = 115200;
    uint32_t uart_divisor = ESP8266_REG(0x14) & UART_CLK_DIVISOR_M;
    uint32_t master_freq = crystal_freq * 2;

    if (REASON_DEFAULT_RST       == hwdt_info.reset_reason ||
        REASON_EXT_SYS_RST       == hwdt_info.reset_reason ||
        REASON_DEEP_SLEEP_AWAKE  == hwdt_info.reset_reason) {
        /*
         * At this time, with a power on boot or EXT_RSTs the CPU Frequency
         * calibration has not happended. Thus for a 26MHz Xtal, the CPU clock
         * is running at 52MHz. Tweak uart speed here, so printing works.
         * To avoid confusion at exit, put the divisor back as we found it.
         */
        master_freq = crystal_freq * 2;
    } else {
        /*
         * No adjustments needed on reboots, etc.
         * Avoid accumulating divide errors.
         */
        master_freq = ((uart_divisor * rom_uart_speed) < 100000000) ? 80000000 : 160000000;
    }
    uint32_t new_uart_divisor = master_freq / new_speed;

    int rc = 1;
    if (new_uart_divisor != uart_divisor) {
        /*
         * These delays appear to resolve the lost data problem that occurs when
         * printing after a flash upload using esptool.
         */
        ets_delay_us(18000);
        rc = real_uart_div_modify(0, new_uart_divisor);
        ets_delay_us(1000);
    }
#if defined(DEBUG_HWDT_DEBUG)
    ets_printf("\n\n%d = real_uart_div_modify(0, %u / %u);\n", rc, master_freq, new_speed);
    ets_printf("F_CRYSTAL = %u\n", crystal_freq);
    ets_printf("old uart_divisor = %u\n", uart_divisor);
    ets_printf("master_freq = %u\n", master_freq);
#endif
    return (rc) ? 0 : uart_divisor;
}
#endif

/*
 *
 *
 *
 *
 */
static void ICACHE_RAM_ATTR handle_hwdt(void) {

    ets_memset(&hwdt_info, 0, sizeof(hwdt_info));
    check_g_pcont_validity();

    bool power_on = false;
    bool hwdt_reset = false;
    get_reset_reason(&power_on, &hwdt_reset);

#ifdef HWDT_UART_SPEED
    uint32_t uart_divisor = set_uart_speed(0, HWDT_UART_SPEED);
#endif
#if defined(DEBUG_HWDT_DEBUG)
    ets_printf("Basic boot reason: %s\n", (power_on) ? "Power-on" : "Reboot");
    ets_printf("RTC_SYS Reset Reason = %u\n", hwdt_info.rtc_sys_reason);
    ets_printf("ROM API Reset Reason = %u\n", hwdt_info.rom_api_reason);
    ets_printf("HWDT Reset Reason = %u\n\n", hwdt_info.reset_reason);
#endif
#if defined(DEBUG_HWDT_DEBUG_RESET_REASON)
    if (REASON_EXT_SYS_RST < hwdt_info.reset_reason) {
        ets_printf("Reset reason confirmation failed!\n");
        ets_printf("  RTC_SYS Reset Reason = %u\n", hwdt_info.rtc_sys_reason);
        ets_printf("  ROM API Reset Reason = %u\n", hwdt_info.rom_api_reason);
    }
#endif
    // After a flash upload memory cannot be trusted.
    if (!power_on && hwdt_info.g_pcont_valid) {
        uint32_t cont_integrity = 0;
        if (g_pcont->stack_guard1 != CONT_STACKGUARD) {
          cont_integrity |= 0x0001;
        }
        if (g_pcont->stack_guard2 != CONT_STACKGUARD) {
          cont_integrity |= 0x0020;
        }
        if (g_pcont->stack_end != (g_pcont->stack + (sizeof(g_pcont->stack) / 4))) {
          cont_integrity |= 0x0300;
          // Fix ending so we don't crash
          g_pcont->stack_end = (g_pcont->stack + (sizeof(g_pcont->stack) / 4));
        }
        if (g_pcont->struct_start != (unsigned*) g_pcont) {
          cont_integrity |= 0x4000;
        }
        hwdt_info.cont_integrity = cont_integrity;

#if defined(DEBUG_HWDT_NO4KEXTRA) || defined(HWDT_INFO)
        const uint32_t *ctx_cont_ptr = skip_stackguard(g_pcont->stack, g_pcont->stack_end, CONT_STACKGUARD);
        hwdt_info.cont = (uintptr_t)g_pcont->stack_end - (uintptr_t)ctx_cont_ptr;
#endif

        const uint32_t *ctx_sys_ptr = skip_stackguard(sys_stack, rom_stack, CONT_STACKGUARD);
        hwdt_info.sys = (uintptr_t)rom_stack - (uintptr_t)ctx_sys_ptr;

        /* Print context SYS */
        if (hwdt_reset) {
            ets_printf("\nHardware WDT reset\n");
            print_stack((uintptr_t)ctx_sys_ptr, (uintptr_t)rom_stack, PRINT_STACK::SYS);

#ifdef DEBUG_HWDT_NO4KEXTRA
            /* Print separate ctx: cont stack */
            print_stack((uintptr_t)ctx_cont_ptr, (uintptr_t)g_pcont->stack_end, PRINT_STACK::CONT);
#endif
        }
    }

    /*
     *  Fill the SDK stack area with CONT_STACKGUARD so we can detect and
     *  skip the unused section of the stack when printing a Stack Dump.
     */
    {
        size_t this_mutch = (uintptr_t)rom_stack - (uintptr_t)sys_stack;
        this_mutch /= sizeof(uint32_t);
        for (size_t i = 0; i < this_mutch; i++) {
            sys_stack[i] = CONT_STACKGUARD;
        }
    }

#if defined(HWDT_INFO) || defined(ROM_STACK_DUMP)
    /*
     *  Reports on rom_stack usage by ROM and eboot.
     *  Used to confirm ROM_STACK_SIZE is large enough.
     */
    {
        const uint32_t *ctx_rom_ptr = skip_stackguard(rom_stack, rom_stack_first, CONT_STACKGUARD);
        hwdt_info.rom = (uintptr_t)rom_stack_first - (uintptr_t)ctx_rom_ptr;
#if defined(ROM_STACK_DUMP)
        print_stack((uintptr_t)ctx_rom_ptr, (uintptr_t)rom_stack_first, PRINT_STACK::ROM);
#endif
    }
#endif

#if defined(HWDT_PRINT_GREETING)
    ets_printf("\n\nHardware WDT Stack Dump - enabled\n\n");
#else
    ets_printf("\n\n");
#endif

#ifdef HWDT_UART_SPEED
    if (uart_divisor) {
        ets_delay_us(18000);
        real_uart_div_modify(0, uart_divisor); // Put it back the way we found it!
        ets_delay_us(1000);
    }
#endif
}

void ICACHE_RAM_ATTR app_entry_start(void) {
#ifdef DEBUG_HWDT_NO4KEXTRA
    /*
     *  Continuation context is in BSS.
     */
    g_pcont = &g_cont;
#else
    /*
     *  The continuation context is on the stack just after the reserved space
     *  for the ROM/eboot stack and before the SYS stack begins.
     *  All computations were done at top, save pointer to it now.
     */
    g_pcont = cont_stack;
#endif
    /*
     *  Use new calculated SYS stack from top.
     *  Call the entry point of the SDK code.
     */
    asm volatile("" ::: "memory");
    asm volatile("mov.n a1, %0\n"
                 "mov.n a3, %1\n"
                 "mov.n a0, %2\n"     // Should never return; however, set return to Boot ROM Breakpoint
                 "jx a3\n" : : "r" (sys_stack_first), "r" (call_user_start), "r" (0x4000044c) );

    __builtin_unreachable();
}


void ICACHE_RAM_ATTR app_entry_redefinable2(void) {
    handle_hwdt();
    app_entry_start();

    __builtin_unreachable();
}

void ICACHE_RAM_ATTR app_entry_redefinable(void) {
    /*
     * There are 4 sections of code that share the stack starting near
     * 0x40000000.
     *   1) The Boot ROM (uses around 640 bytes)
     *   2) The Bootloader, eboot.elf (last seen using 720 bytes.)
     *   3) `app_entry_redefinable()` just before it starts the SDK.
     *   4) The NONOS SDK, optionally the Core when the extra 4K option is
     *      selected.
     *
     * Make the ROM BSS zeroed out memory the home for our temporary stack. That
     * way no additional information will be lost. That will remove this tool
     * from the list of possible concerns for stack overwrite. For now, At this
     * time it is set to 1024.
     *
     */
    asm volatile ("mov.n a1, %0\n"
                  "mov.n a3, %1\n"
                  "mov.n a0, %2\n"
                  "jx a3\n" : : "r" (0x3fffeb30), "r" (app_entry_redefinable2), "r" (0x4000044c) );
    /*
     * TODO: Look at the assembly, I had to split app_entry_redefinable like
     * this to stop some back indexing on the stack. Looks like some temporary
     * storage was set up and was being referenced and I moved it away by
     * changing the stack pointer. Splitting the `app_entry_redefinable()`
     * function into two parts seems to have taken care of that issue.
     */

    __builtin_unreachable();
}


#if defined(HWDT_INFO)
void preinit(void) {
    /*
     * Fill the rom_stack while it is not actively being used.
     *
     * I am thinking that during the time the sketch is running this block of
     * memory could be used for a scratch buffer.
     */
    for (size_t i = 0; i < g_rom_stack_A16_sz/sizeof(uint32_t); i++) {
        g_rom_stack[i] = CONT_STACKGUARD;
    }
}
#endif

};

#else
void enable_debug_hwdt_at_link_time (void){
}
#endif // end of #ifdef DEBUG_HWDT
